# INTRODUCTION

* Pandas is generally used for Data Analysis.
* It allows importing data from various file formats ex- Json,csv,Sql,Excel,etc

# FEATURES:
* Data Manipulation,
* Reading and Writing Data,
* Reshaping of data,
* Data Filteration,
* Data cleaning

# **Creating Dataframe**

* The best way to create a dataframe in python is to use **Dictionary**

In [1]:
import pandas as pd

In [2]:
dict_1={"car":["city","ignis","800","Verna","Venue","Punto"],"brand":["Honda","maruti","Maruti","Hyundia","Hyundai","Fiat"],
         "cost":[900000,600000,100000,800000,950000,750000],"year":[5,7,10,4,2,6]}

In [3]:
auto=pd.DataFrame(dict_1)

In [4]:
auto

     car    brand    cost  year
0   city    Honda  900000     5
1  ignis   maruti  600000     7
2    800   Maruti  100000    10
3  Verna  Hyundia  800000     4
4  Venue  Hyundai  950000     2
5  Punto     Fiat  750000     6

In [5]:
auto.to_csv('automobile.csv')

# Importing Dataframe

In [6]:

import pandas as pd

In [8]:
data=pd.read_csv("titanic.csv")

In [9]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [10]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
 2   Pclass       418 non-null    int64
 3   Name         418 non-null    object
 4   Sex          418 non-null    object
 5   Age          332 non-null    float64
 6   SibSp        418 non-null    int64
 7   Parch        418 non-null    int64
 8   Ticket       418 non-null    object
 9   Fare         417 non-null    float64
 10  Cabin        91 non-null     object
 11  Embarked     418 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 39.3+ KB

In [11]:
data.shape

(418, 12)

In [12]:
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [13]:
data['Embarked'].value_counts()

S    270
C    102
Q     46
Name: Embarked, dtype: int64

In [14]:
data["Sex"].unique()

array(['male', 'female'], dtype=object)

# Accessing Columns

In [15]:
data['Name']

0                                  Kelly, Mr. James
1                  Wilkes, Mrs. James (Ellen Needs)
2                         Myles, Mr. Thomas Francis
3                                  Wirz, Mr. Albert
4      Hirvonen, Mrs. Alexander (Helga E Lindqvist)
                           ...
413                              Spector, Mr. Woolf
414                    Oliva y Ocana, Dona. Fermina
415                    Saether, Mr. Simon Sivertsen
416                             Ware, Mr. Frederick
417                        Peter, Master. Michael J
Name: Name, Length: 418, dtype: object

In [16]:
data[['Name','Sex']]

                                             Name     Sex
0                                Kelly, Mr. James    male
1                Wilkes, Mrs. James (Ellen Needs)  female
2                       Myles, Mr. Thomas Francis    male
3                                Wirz, Mr. Albert    male
4    Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female
..                                            ...     ...
413                            Spector, Mr. Woolf    male
414                  Oliva y Ocana, Dona. Fermina  female
415                  Saether, Mr. Simon Sivertsen    male
416                           Ware, Mr. Frederick    male
417                      Peter, Master. Michael J    male

[418 rows x 2 columns]

# Accessing Rows

In [17]:
data.iloc[[0]]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q

In [18]:
data.loc[1:5,['Name',"Sex"]]

                                           Name     Sex
1              Wilkes, Mrs. James (Ellen Needs)  female
2                     Myles, Mr. Thomas Francis    male
3                              Wirz, Mr. Albert    male
4  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female
5                    Svensson, Mr. Johan Cervin    male

# Changing index

In [34]:
data=data.set_index("PassengerId")

In [36]:
data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

# Filtering of data

In [37]:
new_data=data["Sex"]=="male"

In [38]:
data.loc[new_data]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
897,0,3,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,NaN,S
899,0,2,"Caldwell, Mr. Albert Francis",male,26.0,1,1,248738,29.0000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
1299,0,1,"Widener, Mr. George Dunton",male,50.0,1,1,113503,211.5000,C80,C
1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [41]:
isin_1 = auto['car'].isin(['800','city'])

In [42]:
auto.loc[isin_1]

    car  brand      cost  year
0  city  Honda  900000.0   5.0

In [ ]:
start=auto['brand'].str.startswith('H')
auto.loc[start]

In [ ]:
ends = auto['brand'].str.endswith('i')
auto.loc[ends]

In [ ]:
contains = ~auto['brand'].str.contains('o')
auto.loc[contains]

In [ ]:
auto.loc[-contains]

In [ ]:
isna = auto['car'].isna()
auto.loc[isna]

In [ ]:
notna = auto['car'].notna()
auto.loc[notna]

# Sorting of Data

In [44]:
auto.sort_values("cost")

     car    brand      cost  year
2    NaN   Maruti       0.0  10.0
6    NaN      NaN       0.0   NaN
1  ignis   maruti  600000.0   7.0
5  Punto     Fiat  750000.0   6.0
3  Verna  Hyundia  800000.0   NaN
0   city    Honda  900000.0   5.0
4  Venue      NaN  950000.0   NaN

In [45]:
data.sort_values(['Age', 'Sex'],
                       ascending=[True, False])

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1246,1,3,"Dean, Miss. Elizabeth Gladys Millvina""""",female,0.17,1,2,C.A. 2315,20.5750,NaN,S
1093,0,3,"Danbom, Master. Gilbert Sigvard Emanuel",male,0.33,0,2,347080,14.4000,NaN,S
1173,0,3,"Peacock, Master. Alfred Edward",male,0.75,1,1,SOTON/O.Q. 3101315,13.7750,NaN,S
1199,0,3,"Aks, Master. Philip Frank",male,0.83,0,1,392091,9.3500,NaN,S
1142,1,2,"West, Miss. Barbara J",female,0.92,1,2,C.A. 34651,27.7500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
1196,1,3,"McCarthy, Miss. Catherine Katie""""",female,NaN,0,0,383123,7.7500,NaN,Q
1257,1,3,"Sage, Mrs. John (Annie Bullen)",female,NaN,1,9,CA. 2343,69.5500,NaN,S
1274,1,3,"Risien, Mrs. Samuel (Emma)",female,NaN,0,0,364498,14.5000,NaN,S
1300,1,3,"Riordan, Miss. Johanna Hannah""""",female,NaN,0,0,334915,7.7208,NaN,Q
1302,1,3,"Naughton, Miss. Hannah",female,NaN,0,0,365237,7.7500,NaN,Q

# Updating Columns and Rows

Changing the name of columns

In [47]:
auto.columns=[x.capitalize() for x in auto.columns]

In [48]:
auto

     Car    Brand      Cost  Year
0   city    Honda  900000.0   5.0
1  ignis   maruti  600000.0   7.0
2    NaN   Maruti       0.0  10.0
3  Verna  Hyundia  800000.0   NaN
4  Venue      NaN  950000.0   NaN
5  Punto     Fiat  750000.0   6.0
6    NaN      NaN       0.0   NaN

In [49]:
auto.columns=[x.lower() for x in auto.columns]

In [50]:
auto

     car    brand      cost  year
0   city    Honda  900000.0   5.0
1  ignis   maruti  600000.0   7.0
2    NaN   Maruti       0.0  10.0
3  Verna  Hyundia  800000.0   NaN
4  Venue      NaN  950000.0   NaN
5  Punto     Fiat  750000.0   6.0
6    NaN      NaN       0.0   NaN

In [51]:
auto.rename(columns={"brand":"company","cost":"price"},inplace=True)

In [52]:
auto

     car  company     price  year
0   city    Honda  900000.0   5.0
1  ignis   maruti  600000.0   7.0
2    NaN   Maruti       0.0  10.0
3  Verna  Hyundia  800000.0   NaN
4  Venue      NaN  950000.0   NaN
5  Punto     Fiat  750000.0   6.0
6    NaN      NaN       0.0   NaN

***Updating Columns***

In [ ]:
auto["price"]=auto["price"].replace({600000:100000})

In [ ]:
auto

In [ ]:
auto["car"].apply(str.upper)

In [ ]:
def price_change(price):
    return price/10

In [ ]:
auto["price"].apply(price_change)

In [ ]:
auto["price"].apply(lambda x:x*10)

In [ ]:
auto["car"].replace({"city":"city zx","ignis":"swift"})

***Updating Rows***

In [ ]:
auto.loc[2,["car","price"]]=["dezire",600000]

In [ ]:
auto

***Adding and removing a column***

In [ ]:
fuel_type=["Diesel","Petrol","Petrol","Diesel","Petrol","Diesel"]

In [ ]:
auto["Fuel Types"]=fuel_type

In [ ]:
auto

In [ ]:
auto.drop("Fuel Types",axis=1,inplace=True)

***Adding and Removing Rows***

In [ ]:
auto=auto.append({"car":"Tiago","company":"TATA"},ignore_index=True)

In [ ]:
auto.drop(index=6)

# Grouping And Aggregation

In [30]:
groups = data.groupby(['Sex'])

In [31]:
groups.mean()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
Sex,,,,,,,
female,1096.789474,1.0,2.144737,30.272362,0.565789,0.598684,49.747699
male,1102.620301,0.0,2.334586,30.272732,0.379699,0.274436,27.527877

In [32]:
groups.size()

Sex
female    152
male      266
dtype: int64

In [33]:
groups.count()

,PassengerId,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Sex,,,,,,,,,,,
female,152,152,152,152,127,152,152,152,152,44,152
male,266,266,266,266,205,266,266,266,265,47,266

# Cleaning of Data

In [19]:
import numpy as np

dict_1={"car":["city","ignis",np.nan,"Verna","Venue","Punto",np.nan],"brand":["Honda","maruti","Maruti","Hyundia",np.nan,"Fiat",np.nan],
         "cost":[900000,600000,np.nan,800000,950000,750000,np.nan,],"year":[5,7,10,np.nan,np.nan,6,np.nan]}        


auto=pd.DataFrame(dict_1)

In [21]:
auto.isnull().sum()

car      2
brand    2
cost     2
year     3
dtype: int64

In [22]:
auto.dropna(axis="index",how='all',subset=["cost"])

     car    brand      cost  year
0   city    Honda  900000.0   5.0
1  ignis   maruti  600000.0   7.0
3  Verna  Hyundia  800000.0   NaN
4  Venue      NaN  950000.0   NaN
5  Punto     Fiat  750000.0   6.0

In [28]:
auto["cost"].fillna(0,inplace=True)

In [29]:
auto

     car    brand      cost  year
0   city    Honda  900000.0   5.0
1  ignis   maruti  600000.0   7.0
2    NaN   Maruti       0.0  10.0
3  Verna  Hyundia  800000.0   NaN
4  Venue      NaN  950000.0   NaN
5  Punto     Fiat  750000.0   6.0
6    NaN      NaN       0.0   NaN